IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCICIO-9.
DATA DIVISION.
FILE SECTION.
  WORKING-STORAGE SECTION.
    01 BOI.
      03 WS-PESO-BOI PIC 9(3)V99.
      03 WS-NUMERO-BOI PIC 9(2).
    77 WS-NUMERO-MAIOR-PESO PIC 9(2).
    77 WS-NUMERO-MENOR-PESO PIC 9(2).
    77 WS-MAIOR-PESO PIC 9(3)V99.
    77 WS-MENOR-PESO PIC 9(3)V99.
    77 WS-CONTAGEM PIC 9(2) VALUE 5.
    77 WS-SOMA-PESO PIC 9(5).
    77 WS-MEDIA-PESO PIC 9(5)V99.
PROCEDURE DIVISION.
  DISPLAY "COLOQUE O NUMERO DO BOI : ".
  ACCEPT WS-NUMERO-BOI.
  DISPLAY "COLOQUE O PESO DO BOI : ".
  ACCEPT WS-PESO-BOI.
  COMPUTE WS-NUMERO-MAIOR-PESO = WS-NUMERO-BOI.
  COMPUTE WS-NUMERO-MENOR-PESO = WS-NUMERO-BOI.
  COMPUTE WS-MAIOR-PESO = WS-PESO-BOI.
  COMPUTE WS-MENOR-PESO = WS-PESO-BOI.
  COMPUTE WS-SOMA-PESO = WS-SOMA-PESO + WS-PESO-BOI.
  PERFORM UNTIL WS-CONTAGEM = 0
    DISPLAY "COLOQUE O NUMERO DO BOI : "
    ACCEPT WS-NUMERO-BOI
    DISPLAY "COLOQUE O PESO DO BOI : "
    ACCEPT WS-PESO-BOI
    IF WS-PESO-BOI > WS-MAIOR-PESO
      COMPUTE WS-MAIOR-PESO = WS-PESO-BOI
      COMPUTE WS-NUMERO-MAIOR-PESO = WS-NUMERO-BOI
    END-IF
    IF WS-PESO-BOI < WS-MAIOR-PESO
      COMPUTE WS-MENOR-PESO = WS-PESO-BOI
      COMPUTE WS-NUMERO-MENOR-PESO = WS-NUMERO-BOI
    END-IF
    COMPUTE WS-SOMA-PESO = WS-SOMA-PESO + WS-PESO-BOI
    COMPUTE WS-CONTAGEM = WS-CONTAGEM - 1
  END-PERFORM.
  COMPUTE WS-CONTAGEM = 5.
  COMPUTE WS-MEDIA-PESO = WS-SOMA-PESO/WS-CONTAGEM.
  DISPLAY "NUMERO E PESO DO BOI (MAIOR PESO)".
  DISPLAY WS-NUMERO-MAIOR-PESO " " WS-MAIOR-PESO.
  DISPLAY "NUMERO E PESO DO BOI (MENOR PESO)".
  DISPLAY WS-NUMERO-MENOR-PESO " " WS-MENOR-PESO.
  DISPLAY "MEDIA DO PESO DOS BOIS " WS-MEDIA-PESO.
STOP RUN.
END PROGRAM EXERCICIO-9.
