IDENTIFICATION DIVISION.
PROGRAM-ID. YOUR-PROGRAM-NAME.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
    77 NUMERO-FINAL PIC 99 VALUE 11.
    77 CONTADOR-ZERO-DEZ PIC 99 VALUE 1.
    77 RESULTADO PIC 99.
    77 NUMERO-INICIAL PIC 99 VALUE 1.
PROCEDURE DIVISION.
    PERFORM UNTIL NUMERO-INICIAL = NUMERO-FINAL
        COMPUTE CONTADOR-ZERO-DEZ = 1
        DISPLAY "TABUADA DO >> " NUMERO-INICIAL
        PERFORM UNTIL CONTADOR-ZERO-DEZ = (NUMERO-FINAL - 1)
            COMPUTE RESULTADO = NUMERO-INICIAL * CONTADOR-ZERO-DEZ
            DISPLAY NUMERO-INICIAL " X " CONTADOR-ZERO-DEZ " = " RESULTADO
            COMPUTE CONTADOR-ZERO-DEZ = CONTADOR-ZERO-DEZ + 1
        END-PERFORM
        COMPUTE NUMERO-INICIAL = NUMERO-INICIAL + 1
    END-PERFORM.
END PROGRAM YOUR-PROGRAM-NAME.
