IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCICIO-4.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 QUANTIDADE PIC 999.
        77 DESPESAS PIC 999 VALUE 600.
        77 RECEITAS PIC 9999.
        77 LUCRO PIC 9999.
        77 CONTADOR PIC 9(1) VALUE 5.
        77 LUCRO-MAXIMO PIC 9999.
        77 INGRESSO-MAXIMO PIC 999.
        77 VALOR-INGRESSO PIC 99.
PROCEDURE DIVISION.
    COMPUTE VALOR-INGRESSO = 15.
    COMPUTE QUANTIDADE = 120.
    COMPUTE LUCRO-MAXIMO = 0.
    COMPUTE INGRESSO-MAXIMO = 0.
    DISPLAY "INFO=====================================================".
    PERFORM UNTIL VALOR-INGRESSO <= 0
        COMPUTE RECEITAS = QUANTIDADE * VALOR-INGRESSO
        COMPUTE LUCRO = RECEITAS - DESPESAS
        DISPLAY " "
        DISPLAY "RODADA : " CONTADOR
        DISPLAY "QUANTIDADE : " QUANTIDADE  " | VALOR INGRESSO R$: " VALOR-INGRESSO
        DISPLAY "RECEITA : R$" RECEITAS " | DESPESAS : R$" DESPESAS " | LUCRO R$" LUCRO
        COMPUTE VALOR-INGRESSO = VALOR-INGRESSO - 3
        COMPUTE QUANTIDADE = QUANTIDADE + ((QUANTIDADE * 30)/100)
        COMPUTE CONTADOR = CONTADOR - 1
        IF(LUCRO > LUCRO-MAXIMO)
            COMPUTE LUCRO-MAXIMO = LUCRO
            COMPUTE INGRESSO-MAXIMO = QUANTIDADE
        END-IF
    END-PERFORM.
    DISPLAY "FINAL.".
    DISPLAY "LUCRO MAXIMO : " LUCRO-MAXIMO.
    DISPLAY "INGRESSO MAXIMO : " INGRESSO-MAXIMO.
    DISPLAY "========================================================="
STOP RUN.
